{
  "bringYourOwnUserAssignedManagedIdentity": {
    "type": "Boolean",
    "metadata": {
      "displayName": "Bring Your Own User-Assigned Identity",
      "description": "Enable this to use your pre-created user-assigned managed identity. The pre-created identity MUST exist within the subscription otherwise the policy deployment will fail. If enabled, ensure that the User-Assigned Identity Name and Identity Resource Group Name parameters match the pre-created identity. If not enabled, the policy will create per subscription, per resource user-assigned managed identities in a new resource group named 'Built-In-Identity-RG'."
    },
    "allowedValues": [
      true,
      false
    ]
  },
  "restrictBringYourOwnUserAssignedIdentityToSubscription": {
    "type": "Boolean",
    "metadata": {
      "displayName": "Restrict Bring Your Own User-Assigned Identity to Subscription",
      "description": "Enable this to enforce the user assigned identity must exist in the same subscription as the virtual machine. When true, must provide User-Assigned Managed Identity Name and User-Assigned Managed Identity Resource Group Name parameters. When false, the parameter User Assigned Managed Identity Resource Id will be used instead."
    },
    "allowedValues": [
      true,
      false
    ],
    "defaultValue": true
  },
  "userAssignedIdentityResourceId": {
    "type": "String",
    "metadata": {
      "displayName": "User-Assigned Managed Identity Resource ID",
      "description": "The resource ID of the pre-created user-assigned managed identity. This parameter is only used when the restrict Bring Your Own User-Assigned Identity To Subscription parameter is false."
    },
    "defaultValue": ""
  },
  "userAssignedIdentityName": {
    "type": "String",
    "metadata": {
      "displayName": "User-Assigned Managed Identity Name",
      "description": "The name of the pre-created user-assigned managed identity."
    },
    "defaultValue": ""
  },
  "identityResourceGroup": {
    "type": "String",
    "metadata": {
      "displayName": "User-Assigned Managed Identity Resource Group Name",
      "description": "The resource group in which the pre-created user-assigned managed identity resides."
    },
    "defaultValue": ""
  },
  "builtInIdentityResourceGroupLocation": {
    "type": "String",
    "metadata": {
      "displayName": "Built-In-Identity-RG Location",
      "description": "The location of the resource group 'Built-In-Identity-RG' created by the policy. This parameter is only used when 'Bring Your Own User Assigned Identity' parameter is false."
    },
    "defaultValue": "eastus"
  },
  "effect": {
    "type": "String",
    "metadata": {
      "displayName": "Policy Effect",
      "description": "The effect determines what happens when the policy rule is evaluated to match."
    },
    "allowedValues": [
      "AuditIfNotExists",
      "DeployIfNotExists",
      "Disabled"
    ],
    "defaultValue": "DeployIfNotExists"
  }
}
